In [1]:
import numpy as np
import pandas as pd

/var/folders/cb/_sq_tg5520j6b_7frhqkt60r0000gn/T/ipykernel_40811/1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [5]:
seri = pd.Series(np.random.randint(0,50,8))
seri

0     9
1    23
2     5
3     3
4     5
5    10
6    40
7    40
dtype: int64

### head

In [15]:
seri.head(3) # İçine girilen değer kadar baştaki verileri getirir. default = 5

0    36
1     6
2    46
dtype: int32

### tail

In [16]:
seri.tail(3) # İçine girilen değer kadar sondaki verileri getirir. default = 5

5    13
6     3
7    35
dtype: int32

### sample

In [20]:
seri.sample(2) # İçine girilen değer kadar random örneklem getirir. default = 1

1     6
4    25
dtype: int32

### sort_values

In [22]:
seri.sort_values(ascending= True) #value değerlerini sıralar.

6     3
1     6
5    13
4    25
3    30
7    35
0    36
2    46
dtype: int32

In [23]:
seri.sort_values(ascending= False) # value değerlerini tersten sıralar.

2    46
0    36
7    35
3    30
4    25
5    13
1     6
6     3
dtype: int32

### sort_index

In [24]:
seri.sort_index(ascending= True) # index değerlerini sıralar.

0    36
1     6
2    46
3    30
4    25
5    13
6     3
7    35
dtype: int32

In [25]:
seri.sort_index(ascending= False) # index değerlerini tersten sıralar.

7    35
6     3
5    13
4    25
3    30
2    46
1     6
0    36
dtype: int32

### DataFrames

2D veri koleksiyonudur. Veriler tablo (tabular) şeklinde saklanır.  

Satır (İndex) ve Sütun isimlerini kendimiz verebiliriz.

In [7]:
list_1 = [[1,2,3],[4,5,6]]
index_name = ["S","F"]
column_name = ["A", "B", "C"]

df = pd.DataFrame(data = list_1, index= index_name ,columns = column_name, )
df

   A  B  C
S  1  2  3
F  4  5  6

In [9]:
list_1 = [[1,2,3],[4,5,6]]  
index_name = ["S","F"]
column_name = ["A", "B", "C", "D"] #HATA! Sütun sayısı ile veri sayısı eşleşmelidir.

df = pd.DataFrame(data = list_1, index= index_name ,columns = column_name, )
df

ValueError: 4 columns passed, passed data had 3 columns

### DataFrameleri Numpy Arrays ile kullanma

In [29]:
arr1 = np.arange(1,27,3).reshape(3,3)
arr1

array([[ 1,  4,  7],
       [10, 13, 16],
       [19, 22, 25]])

In [32]:
df = pd.DataFrame(data = arr1, index=["B","L","T"], columns= ["S","R","S"])
df

    S   R   S
B   1   4   7
L  10  13  16
T  19  22  25

Not: data, index, columns positionaldır ve yerlerine bir şey yazmasak bile bu sırayla çalışırlar. 

Ancak yazmak okunurluğu artırır, iyidir hojjdur.

In [33]:
df = pd.DataFrame(arr1, ["B","L","T"], ["S","R","S"])
df

    S   R   S
B   1   4   7
L  10  13  16
T  19  22  25

### DataFrameleri Dictionary ile kullanma

Sütun isimlerini veri oluştururken gireriz.

In [36]:
data = {"Name": ["Koba", "Bulut", "Günes"], "Age":[3,4,5]}
pd.DataFrame(data = data)

    Name  Age
0   Koba    3
1  Bulut    4
2  Günes    5

In [47]:
data = {"Name": ["Koba", "Bulut", "Günes"], "Age":[3,4,5]} 
pd.DataFrame(data = data, index=["S","R","S"]) # index isimlerini dictionarylerde de verebiliriz.

    Name  Age
S   Koba    3
R  Bulut    4
S  Günes    5

In [42]:
aa = pd.DataFrame(data = data, columns=["Name","Age","Tatlılık_Dereceleri"]) 
aa      #Dictionary'de fazla değer girilirse hata yerine NaN alırız. shape = (3,3)

    Name  Age Tatlılık_Dereceleri
0   Koba    3                 NaN
1  Bulut    4                 NaN
2  Günes    5                 NaN

In [43]:
bb = pd.DataFrame(data = data, columns=["İsim","Yas","Tatlılık_Dereceleri"]) 
bb  #Hiç data'daki sütun isimleriyle eşleşen olmadığı için boş verdi. shape = (0,3)

Empty DataFrame
Columns: [İsim, Yas, Tatlılık_Dereceleri]
Index: []

### DataFrame Methodları

- head, tail, sample, columns, index, x.mean

In [50]:
data = {"Name": ["Koba", "Bulut", "Günes"], "Age":[3,4,5]} 
df = pd.DataFrame(data)
df

    Name  Age
0   Koba    3
1  Bulut    4
2  Günes    5

In [51]:
df.head(2)

    Name  Age
0   Koba    3
1  Bulut    4

In [52]:
df.tail(2)

    Name  Age
1  Bulut    4
2  Günes    5

In [53]:
df.sample()

    Name  Age
1  Bulut    4

In [54]:
df.columns[0]

'Name'

In [56]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [58]:
df.Age.mean() #doğrudan mean yazarsak içerisinde sayı olmayan değerler de olduğundan dolayı hata alırız.

4.0

### Indexing, Slicing & Selection

In [60]:
data = {"isim": ["Umut","Ulas","Serhan","Sylvanas"], "boy cm":[197,190,177,40],"kilo-kg":[85,85,77,3]}

In [61]:
df = pd.DataFrame(data = data, index = ["A","B","C","D"])
df

       isim  boy cm  kilo-kg
A      Umut     197       85
B      Ulas     190       85
C    Serhan     177       77
D  Sylvanas      40        3

In [67]:
df["boy cm"] # Pandas Series

A    197
B    190
C    177
D     40
Name: boy cm, dtype: int64

In [68]:
df[["boy cm"]] # Data Frames

   boy cm
A     197
B     190
C     177
D      40

In [65]:
df.columns

Index(['isim', 'boy cm', 'kilo-kg'], dtype='object')

Slicing yaparken tek bir index ismi girersek data ismi zanneder, ama slicing şeklinde yazarsak anlar.

In [70]:
df["A"]

KeyError: 'A'

In [69]:
df["A":"D"]

       isim  boy cm  kilo-kg
A      Umut     197       85
B      Ulas     190       85
C    Serhan     177       77
D  Sylvanas      40        3

### Yeni bir Sütun oluşturma

In [71]:
df["BMI"] = df["kilo-kg"] / (df["boy cm"] / 100) **2
df #For döngüsünü kendi otomatik gerçekleştirdi. DataFrame'de döngü yazmaya ihtiyaç olmaz.

       isim  boy cm  kilo-kg        BMI
A      Umut     197       85  21.902136
B      Ulas     190       85  23.545706
C    Serhan     177       77  24.577867
D  Sylvanas      40        3  18.750000

In [72]:
df["New"] = np.arange(4) #Bu şekilde de yeni bir sütun eklemiş olduk.
df

       isim  boy cm  kilo-kg        BMI  New
A      Umut     197       85  21.902136    0
B      Ulas     190       85  23.545706    1
C    Serhan     177       77  24.577867    2
D  Sylvanas      40        3  18.750000    3

### VERİLER ÜZERİNDE CALİSMALAR

In [76]:
df = pd.read_csv("adult_eda.csv") #Bu şekilde çağırırız. Bizlere ilk 5 ve son 5 verileri getirir. head ve tail'ı harici de çağırabiliriz.
df

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12.0,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9.0,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9.0,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9.0,Never-married,Adm-clerical,NaN,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [78]:
df.shape

(32561, 15)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   31759 non-null  float64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    27493 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: float64(1), int64(5), object(9)
memory usage: 3.7+ MB

In [81]:
df.isnull().sum() #Tüm sütunların boş olan verileirni sum ile topladı ve sayı döndürdü. 802 null ve 5068 null (NaN) var.

age                  0
workclass            0
fnlwgt               0
education            0
education-num      802
marital-status       0
occupation           0
relationship      5068
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country       0
salary               0
dtype: int64